[
  {
    "id": 1,
    "identifier": "1a",
    "name": "Sonar Sweep Part 1",
    "description": "The first order of business is to figure out how quickly the depth increases. To do this, count the number of times a depth measurement increases from the previous measurement. (There is no measurement before the first measurement.)\n\n199 (N/A - no previous measurement)\n200 (increased)\n208 (increased)\n210 (increased)\n200 (decreased)\n207 (increased)\n240 (increased)\n269 (increased)\n260 (decreased)\n263 (increased)",
    "success": true,
    "link": "https://adventofcode.com/2021/day/1"
  },
  {
    "id": 2,
    "identifier": "1b",
    "name": "Sonar Sweep Part 2",
    "description": "Considering every single measurement isn't as useful as you expected: there's just too much noise in the data. Instead, consider sums of a three-measurement sliding window. Again considering the above example: \n\n199  A      \n200  A B    \n208  A B C  \n210    B C D\n200  E   C D\n207  E F   D\n240  E F G  \n269    F G H\n260      G H\n263        H",
    "success": true,
    "link": "https://adventofcode.com/2021/day/1"
  },
  {
    "id": 3,
    "identifier": "2a",
    "name": "Dive Part 1",
    "description": "It seems like the submarine can take a series of commands like forward 1, down 2, or up 3:\n\nforward X increases the horizontal position by X units.\ndown X increases the depth by X units.\nup X decreases the depth by X units. \n\nCalculate the horizontal position and depth you would have after following the planned course. What do you get if you multiply your final horizontal position by your final depth?",
    "success": true,
    "link": "https://adventofcode.com/2021/day/2"
  },
  {
    "id": 4,
    "identifier": "2b",
    "name": "Dive Part 2",
    "description": "In addition to horizontal position and depth, you'll also need to track a third value, aim, which also starts at 0. The commands also mean something entirely different than you first thought:\n\ndown X increases your aim by X units.\nup X decreases your aim by X units.\nforward X does two things:\nIt increases your horizontal position by X units.\nIt increases your depth by your aim multiplied by X.\n\nNow, the above example does something different:\n\nforward 5 adds 5 to your horizontal position, a total of 5. Because your aim is 0, your depth does not change.\ndown 5 adds 5 to your aim, resulting in a value of 5.\nforward 8 adds 8 to your horizontal position, a total of 13. Because your aim is 5, your depth increases by 8*5=40.\nup 3 decreases your aim by 3, resulting in a value of 2.\ndown 8 adds 8 to your aim, resulting in a value of 10.\nforward 2 adds 2 to your horizontal position, a total of 15. Because your aim is 10, your depth increases by 2*10=20 to a total of 60.",
    "success": true,
    "link": "https://adventofcode.com/2021/day/2"
  }
]
